Услуги/src/DataProcessors/РаботаСЗапросами/РаботаСЗапросами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСЗапросами</name>
</mdclass:DataProcessor>

Услуги/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Услуги/src/DataProcessors/РаботаСЗапросами/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладнаяМатериалы.Материал КАК Материал,
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Дата КАК Дата,
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер КАК Номер
	|ПОМЕСТИТЬ НакладнаяМатериалы
	|ИЗ
	|	Документ.ПриходнаяНакладная.Материалы КАК ПриходнаяНакладнаяМатериалы
	|ГДЕ
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер = ""000000001""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование,
	|	НакладнаяМатериалы.Дата КАК Дата,
	|	НакладнаяМатериалы.Номер КАК Номер
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладнаяМатериалы КАК НакладнаяМатериалы
	|		ПО Номенклатура.Ссылка = НакладнаяМатериалы.Материал
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
КонецПроцедуры
